# IsShownOnlyWhenCut Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyElementVisibility..::..IsShownOnlyWhenCut Property
FamilyElementVisibility Class See Also
---
Indicates if the instance is displayed only if it has been cut.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsShownOnlyWhenCut { get; set; }
```

Visual Basic
---
```text
Public Property IsShownOnlyWhenCut As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsShownOnlyWhenCut {
	bool get ();
	void set (bool value);
}
```

# Remarks
This property matters for objects which visibility type is ViewSpecific.
# See Also
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace